content/engineering/software-engineering/.system-engineering.org
#+STARTUP: overview
#+OPTIONS: \n:t
#+EXPORT_FILE_NAME:	system-engineering
#+TITLE:	System Engineering
#+AUTHOR:	Shawn Dennis Lin
#+EMAIL:	ShawnDennisLin@gmail.com
#+DATE:	[2021-09-09 Thu]

* Content :TOC_2_gh:noexport:
- [[#linux][Linux]]
  - [[#command][Command]]
  - [[#system][System]]
  - [[#systemd][Systemd]]
  - [[#action][Action]]
  - [[#problem][Problem]]
  - [[#wsl][WSL]]
  - [[#kali-linux][Kali Linux]]
- [[#windows][Windows]]
  - [[#command-1][Command]]

* Linux
- [[http://linux-wiki.cn/wiki/zh-tw/Linux%E7%9B%AE%E5%BD%95%E7%BB%93%E6%9E%84][Linux目錄結構]]
- [[https://kknews.cc/zh-tw/code/ggepgbe.html][為什麼伺服器要選擇 Linux]]
- [[https://blog.gtwang.org/linux/safe-reboot-of-linux-using-magic-sysrq-key/][使用 SysRq 鍵讓當機的 Linux 安全地重新開機]]
