content/engineering/software-engineering/system-engineering.md
+++
title = "System Engineering"
author = ["Shawn Dennis Lin"]
date = 2021-09-09T00:00:00+08:00
draft = false
+++

## Linux {#linux}

-   [Linux目錄結構](http://linux-wiki.cn/wiki/zh-tw/Linux%E7%9B%AE%E5%BD%95%E7%BB%93%E6%9E%84)
-   [為什麼伺服器要選擇 Linux](https://kknews.cc/zh-tw/code/ggepgbe.html)
-   [使用 SysRq 鍵讓當機的 Linux 安全地重新開機](https://blog.gtwang.org/linux/safe-reboot-of-linux-using-magic-sysrq-key/)
