content/engineering/software-engineering/.system-engineering.org
** Command
| man                         | command                                             | describe                                                       | Ref                                         |   |
|-----------------------------+-----------------------------------------------------+----------------------------------------------------------------+---------------------------------------------+---|
| User                        |                                                     |                                                                |                                             |   |
| =adduser=, =addgroup=       |                                                     | add a user or group to the system                              |                                             |   |
|                             | --disabled-password                                 |                                                                |                                             |   |
| =chown=                     | ~chown -R <user>:<group> <folder_1> ... <folder_n>~ | Chown User and Group Recursively                               | [[https://devconnected.com/how-to-chown-recursive-on-linux/][How To Chown Recursively on Linux]]           |   |
| =passwd=                    |                                                     |                                                                |                                             |   |
| =groups=                    |                                                     | print the groups a user is in                                  |                                             |   |
|                             | ~sudo usermod -a -G <GROUP> <yourusername>~         | Add your user to <GROUP> group                                 |                                             |   |
|                             | ~gpasswd -d <user> <group>~                         | remote <group> from <user>                                     |                                             |   |
| =userdel=                   | ~userdel [options] LOGIN~                           | delete a user account and related files (need to use =sudo -=) | [[https://tw.godaddy.com/help/linux-19158][移除 Linux 使用者]]                           |   |
|                             | ~userdel -r <user>~                                 |                                                                |                                             |   |
|                             |                                                     |                                                                |                                             |   |
|-----------------------------+-----------------------------------------------------+----------------------------------------------------------------+---------------------------------------------+---|
| System                      |                                                     |                                                                |                                             |   |
| =lsof=                      |                                                     | list open files                                                |                                             |   |
|                             | ~sudo lsof -i -P -n ¦ grep LISTEN~                  | check if port is in use in                                     |                                             |   |
|                             | ~sudo netstat -tupln ¦ grep LISTEN~                 |                                                                |                                             |   |
| =df=                        |                                                     | report file system disk space usage                            |                                             |   |
|                             | ~df -h~                                             | print sizes in powers of 1024 (e.g., 1023M)                    |                                             |   |
|                             | ~sodu df -sh [path]~                                | Get the Size of a Directory                                    |                                             |   |
| =mount=                     |                                                     | mount a filesystem                                             |                                             |   |
| =umount=                    |                                                     | unmount file systems                                           |                                             |   |
| =fdisk=                     | ~fdisk [options] device~                            | manipulate disk partition table                                |                                             |   |
|                             | ~fdisk -l [device...]~                              | list disk                                                      |                                             |   |
| =mkfs=                      |                                                     | build a Linux filesystem                                       |                                             |   |
| =e2label=                   | ~e2label device [ volume-label ]~                   | Change the label on an ext2/ext3/ext4 filesystem               |                                             |   |
| =lsblk=                     |                                                     | list block devices                                             |                                             |   |
| =parted=, =dd=, =mkfs.ext4= |                                                     |                                                                | [[https://linuxize.com/post/how-to-format-usb-sd-card-linux/][Format USB Drives and SD Cards]]              |   |
| =mlabel=                    | ~sudo mlabel -i /dev/sdb1 -s ::"LABEL HERE "~       | change a USB stick name                                        | [[https://superuser.com/a/1022998][change a USB stick name]]                     |   |
| =apt=, =dpkg=               |                                                     |                                                                | [[https://samwhelp.github.io/book-ubuntu-basic-skill/book/content/package/index.html][一些套件相關的技巧]]                          |   |
| =timedatectl=               | ~timedatectl list-timezones~                        |                                                                |                                             |   |
|                             | ~sudo timedatectl set-timezone Asia/Taipei~         |                                                                | [[https://linuxize.com/post/how-to-set-or-change-timezone-in-linux/][How to Set or Change the Time Zone in Linux]] |   |
|-----------------------------+-----------------------------------------------------+----------------------------------------------------------------+---------------------------------------------+---|
| file                        |                                                     |                                                                |                                             |   |
| =tail=                      |                                                     | output the last part of files                                  |                                             |   |
| =dd=                        |                                                     | convert and copy a file                                        |                                             |   |
| =find=                      |                                                     | search for files in a directory hierarchy                      | [[https://blog.miniasp.com/post/2010/08/27/Linux-find-command-tips-and-notice][linux-find(TW)]]                              |   |
|                             | ~sudo find / -iname 'filename' -type f~             |                                                                |                                             |   |
|                             | ~sudo find / -iname 'dirname' -type d~              |                                                                |                                             |   |
| =rsync=                     | ~rsync [OPTION...] SRC... [DEST]~                   | a fast, versatile, remote (and local) file-copying tool        |                                             |   |
|                             | ~rsync -avh --del SRC DEST --exclude='path'~        |                                                                |                                             |   |
|                             | ~rsync --info=progress2 source dest~                | copy with progress bar                                         |                                             |   |
|-----------------------------+-----------------------------------------------------+----------------------------------------------------------------+---------------------------------------------+---|
| =wget=                      |                                                     | The non-interactive network downloader.                        |                                             |   |
|                             | ~wget <uri> -P /path/to/folder~                     | path of file                                                   |                                             |   |
|                             | ~wget <uri> -O /path/to/file.ext~                   | path of dictionary                                             |                                             |   |
| =chmod=                     | ~find . -type d -print0 ¦ xargs -0 chmod 755~       | chmod all folder mode to 755                                   |                                             |   |
|                             | ~find . -type f -print0 ¦ xargs -0 chmod 644~       | chmod all file mode to 644                                     |                                             |   |
|                             |                                                     |                                                                |                                             |   |
|-----------------------------+-----------------------------------------------------+----------------------------------------------------------------+---------------------------------------------+---|
| server                      |                                                     |                                                                |                                             |   |
| =nslookup=                  | ~nslookup [-option] [name ¦ -] [server]~            |                                                                | [[https://code.yidas.com/nslookup/][Nslookup]]                                    |   |
|                             | ~nslookup -type=any domain.com~                     |                                                                |                                             |   |
|-----------------------------+-----------------------------------------------------+----------------------------------------------------------------+---------------------------------------------+---|
| network                     |                                                     |                                                                |                                             |   |
| =nc=                        |                                                     |                                                                | [[https://blog.gtwang.org/linux/linux-utility-netcat-examples/][Netcat（Linux nc 指令）網路管理者工具實用範]] |   |
|                             |                                                     |                                                                |                                             |   |
