content/engineering/software-engineering/.system-engineering.org
*** journalctl
| command                       | describe | Ref |   |
|-------------------------------+----------+-----+---|
| By Unit                       |          |     |   |
| ~journalctl -u nginx.service~ |          |     |   |

*** grep
| command   | describe | Ref |   |
|-----------+----------+-----+---|
| ~grep -C~ |          |     |   |

** System
*** Locales & Language pack
#+begin_src sh
sudo apt install -y locales locales-all

sudo apt install -y locales
sudo localedef -i zh_TW -f UTF-8 zh_TW.UTF-8
sudo localedef -i en_US -f UTF-8 en_US.UTF-8
sudo update-locale

#+end_src

+ [[https://blog.csdn.net/weixin_33695082/article/details/92792632][Linux字符集和系统语言设置-LANG,locale,LC_ALL,POSIX等命令及参数详解]]
+ [[https://www.tecmint.com/set-system-locales-in-linux/][How to Change or Set System Locales in Linux]]
** Systemd
- [[https://www.ruanyifeng.com/blog/2018/03/systemd-timer.html][Systemd 定时器教程]]
** Action
*** Format SD card
- [[https://ragnyll.gitlab.io/2018/05/22/format-a-sd-card-to-fat-32linux.html][Format an sd card to fat32 in linux using fdisk]]
*** Rename a volume
- [[https://superuser.com/a/582998][Rename a volume]]

*** Change login background
1. find
2. 

# + Ref: [[https://askubuntu.com/questions/1064491/ubuntu-18-04-change-login-screen-theme-not-wallpaper][https://ubuntuhandbook.org/index.php/2020/05/login-screen-background-ubuntu-20-04/]]
+ https://vitux.com/how-to-change-login-lock-screen-background-in-ubuntu/

*** SMB server
** Problem
*** -bash: sudo: command not found
https://unix.stackexchange.com/a/425664

*** Fix apt-get update “the following signatures couldn’t be verified because the public key is not available”
- [[https://chrisjean.com/fix-apt-get-update-the-following-signatures-couldnt-be-verified-because-the-public-key-is-not-available/][Fix apt-get update “the following signatures couldn’t be verified because the public key is not available”]]
*** crontab
- [[https://blog.gtwang.org/linux/linux-crontab-cron-job-tutorial-and-examples/][Linux 設定 crontab 例行性工作排程教學與範例]]
- [[https://askubuntu.com/questions/56683/where-is-the-cron-crontab-log][corntab log]] 

** WSL
*** Problem
**** release disk space back to the host OS
  =In Posershell=
  #+begin_src sh
  wsl --shutdown
  cd "<dir>" # example C:\Users\shawn\AppData\Local\Packages\CanonicalGroupLimited.Ubuntu20.04onWindows_79rhkp1fndgsc\LocalState
  optimize-vhd -Path .\ext4.vhdx -Mode full
  #+end_src
Ref: https://github.com/microsoft/WSL/issues/4699

**** Access a localhost running in Windows from inside WSL2
Get IP address in cmd: ~ipconfig /all~
windows host: =C:\Windows\System32\drivers\etc\hosts=
Ref: [[https://stackoverflow.com/a/66504604][Access a localhost running in Windows from inside WSL2?]]

**** localhostForwarding
create a file called =.wslconfig= in =C:\Users<your_username>.wslconfig=
#+begin_src sh
[wsl2]
localhostForwarding=true
#+end_src
Ref: [[https://stackoverflow.com/a/65910122][Access a localhost running in Windows from inside WSL2?]]

** Kali Linux
*** OS information
~neofetch~
#+begin_src
..............                                     shdennlin@shdennlinLnb 
            ..,;:ccc,.                             ---------------------- 
          ......''';lxO.                           OS: Kali GNU/Linux Rolling x86_64 
.....''''..........,:ld;                           Host: 81LK IdeaPad L340-15IRH Gaming 
           .';;;:::;,,.x,                          Kernel: 5.14.0-kali2-amd64 
      ..'''.            0Xxoc:,.  ...              Uptime: 36 mins 
  ....                ,ONkc;,;cokOdc',.            Packages: 3316 (dpkg), 4 (snap) 
 .                   OMo           ':ddo.          Shell: zsh 5.8 
                    dMc               :OO;         Resolution: 1920x1080, 1920x1080 
                    0M.                 .:o.       DE: Plasma 5.23.2 
                    ;Wd                            WM: KWin 
                     ;XO,                          Theme: Kali-Dark [Plasma], Breeze [GTK2/3] 
                       ,d0Odlc;,..                 Icons: Flat-Remix-Blue-Dark [Plasma], Flat-Remix-Blue-Dark [GTK2/3] 
                           ..',;:cdOOd::,.         Terminal: konsole 
                                    .:d;.':;.      CPU: Intel i5-9300H (8) @ 4.100GHz 
                                       'd,  .'     GPU: Intel CoffeeLake-H GT2 [UHD Graphics 630] 
                                         ;l   ..   GPU: NVIDIA GeForce GTX 1050 3 GB Max-Q 
                                          .o       Memory: 4166MiB / 15886MiB 
                                            c
                                            .'                             
                                             .                             
#+end_src
*** Install Nvidia driver
*Install*
#+begin_src sh
sudo apt update && sudo apt -y upgrade
sudo apt install -y nvidia-driver nvidia-cuda-toolkit
#+end_src
*Check*
1. lspci|grep VGA
2. nvidia-smi
3. xrandr
4. lspci -v
Ref: https://www.kali.org/docs/general-use/install-nvidia-drivers-on-kali-linux/

*** Display Configuration
1. ~$ sudo vi /etc/X11/xorg.conf~ and add
   #+begin_src conf
   Section "ServerLayout"
   Identifier "layout"
   Screen 0 "nvidia"
   Inactive "intel"
   EndSection

   Section "Device"
   Identifier "nvidia"
   Driver "nvidia"
   BusID  "PCI:1:0:0"
   EndSection

   Section "Screen"
   Identifier "nvidia"
   Device "nvidia"
   EndSection

   Section "Device"
   Identifier "intel"
   Driver "modesetting"
   Option "AccelMethod"  "uxa"
   EndSection

   Section "Screen"
   Identifier "intel"
   Device "intel"
   EndSection
   #+end_src
   Ref: https://github.com/Bumblebee-Project/Bumblebee/wiki/Multi-monitor-setup
   
2. Change display managers
   ~$ sudo dpkg-reconfigure gdm3~ and select =sddm=
   Ref: [[https://ubuntuqa.com/zh-tw/article/6577.html][什麽是gdm3，kdm，lightdm？如何安裝和刪除它們？]]
   
3. add script after start sddm ~$ sudo vi /usr/share/sddm/scripts/Xsetup~ and add below
   #+begin_src sh
   display1="HDMI-0"
   display2="eDP-1-1"

   xrandr --setprovideroutputsource modesetting NVIDIA-0
   xrandr --auto
   xrandr --output $display1 --mode 1920x1080 --primary
   xrandr --output $display2 --right-of $display1 --mode 1920x1080
   #+end_src
   =NOTE=: You need to change display variable by your self, you can use ~$ xrandr~ to see your connected
   
4. (Option) install =autorandr=
   #+begin_src sh
   sudo apt install autorandr
   #+end_src
   Ref: https://github.com/phillipberndt/autorandr


*** Snaps in application launcher (KDE)
~$ sudo -E vi /etc/zsh/zprofile~ and add add the following line:
#+begin_src sh
emulate sh -c 'source /etc/profile'
emulate sh -c 'source /etc/profile.d/apps-bin-path.sh'
#+end_src

Ref: https://www.reddit.com/r/kde/comments/9pjos2/comment/eh0v1um/?utm_source=share&utm_medium=web2x&context=3

*** Snap Error
ERROR:
#+begin_src sh
snap-confine has elevated permissions and is not confined but should be. Refusing to continue to avoid permission escalation attacks
#+end_src
Edit =/lib/apparmor/rc.apparmor.functions= and edit ~ADDITIONAL_PROFILE_DIR=~ to below:
#+begin_src sh
ADDITIONAL_PROFILE_DIR=/var/lib/snapd/apparmor/profiles/
#+end_src
Answer: [[https://github.com/ubuntu/microk8s/issues/249#issuecomment-985227413]]

* Windows
** Command
| man     | command                                              | describe          | Ref |
| =netsh= | ~netsh int ipv4 show excludedportrange protocol=tcp~ | show wdinows port |     |
